title: AWS AdministratorAccess added to IAM User
id: 56fb51a5-bfac-450f-a32d-90802e3b4d8a
status: experimental
description: |
  Detects high-risk action of AdministratorAccess policy being attached to an IAM user.

  This could be indicative of privilege escalation in the event of an attacker, or of over-provisioned access in the event of a legitamate user.
author: zendannyy
date: 2026-06-11
references:
  - https://attack.mitre.org/techniques/T1098/003/
tags:
  - attack.privilege-escalation
  - attack.t1098.003
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_base:
    eventSource: 'iam.amazonaws.com'
    eventName:
      - 'AssumeRole'
      - 'AttachUserPolicy'
  selection_adding_admin:
    requestParameters.policyArn: 'arn:aws:iam::aws:policy/AdministratorAccess'
  condition: >-
    selection_base and selection_adding_admin
  