title: Github Repo Cloned by External User
id: 466f1659-780c-4baf-a6f5-eb6ef6cacfb7
status: experimental
description: |
    Detects action of git clone or git push in a repo where the source actor is not coming from a Corp IP Space.
    (Add your IP Blocks as needed to the filter)
references:
  -  https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/audit-log-events-for-your-enterprise#git
tags:
    - attack.persistence
    - attack.privilege-escalation
logsource:
    product: github
    category: audit
detection:
    selection_action:
      - 'git.clone'
      - 'git.push'
    selection_repo:
      repository_public:
          - 'true'
    filter_ip_space:
      src_ip|cidr:
        - 10.0.0.0/8
        - 172.16.0.0/12
        - 192.168.0.0/16

    condition: >-
      selection_action and selection_repo 
      and not filter_ip_space
level: medium
