title: Github Certificate Auth Disabled
id: b82a9b87-2156-468d-a376-716cff093d9e
status: experimental
description: |
    Detects action of SSH ertificate Auth being disabled. This would mean password auth is allowed. 
    This could indicate an Authentication downgrade attack, disabling Security controls.
references:
  -  https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/audit-log-events-for-your-enterprise#ssh_certificate_authority
tags:
    - attack.persistence
    - attack.privilege-escalation
logsource:
    product: github
    category: audit
detection:
    selection_action:
      - 'ssh_certificate_requirement.disable'
    
    filter_automations:
        TargetFilename|contains:
            - '%automation_scripts%'

    condition: selection_action and not filter_automations
level: medium
