title: Github Branch Protection Disabled
id: 4a86afd3-a49e-4ec6-991f-90bcd495c2a3
status: experimental
description: |
    Detects action of Repo branch protection being disabled. This would mean no PR or review process is needed for that repo and an actor could push arbitrary code.
    Bypassing usual Security controls.
references:
  -  https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/audit-log-events-for-your-enterprise#protected_branch
tags:
    - attack.defense-evasion
    - attack.t1562.001
logsource:
    product: github
    category: audit
detection:
    selection_action:
      - 'protected_branch.destroy'
    
    filter_automations:
        TargetFilename|contains:
            - '%automation_scripts%'
    condition: selection_action and not filter_automations
level: medium

