title: K8s Credential Access to Multiple Secrets
id: c4fc919b-52a2-4718-9c14-8b372637ea30
status: experimental
description: >
  Detects activity where one K8s client accesses many secrets in a short span.
  This could be indicative of Credential access, working towards Privilege Escalation.
tags:
  - attack.t1098.006
  - attack.credential-access
  - attack.privilege.escalation
  - container.kubernetes
author: zendannyy
references:
  - https://attack.mitre.org/techniques/T1552/007/
logsource:
  product: kubernetes
  service: audit
detection:
  selection_verb_resources:
    verb:
      - get
      - update
    objectRef.resource:
      - secrets
  selection_session_status:
    stage: ResponseComplete
  selection_prod_namespace:
    objectRef.namespace:
      - prod
      - production
      - default
  filter_authorized_ip:
    source.ip:
      - 127.0.0.1
  filter_object_name:
    objectRef.name|contains:
      - sh.helm.release
  filter_username:
    user.username|contains:
      - system:serviceaccount:flux-system:helm-controller
      - system:serviceaccount:flux-system:source-controller
      - system:serviceaccount:security:trivy-operator
  condition: >-
    selection_verb_resources and selection_session_status and
    selection_prod_namespace and not filter_*
falsepositives:
  - Controllers may legitimately touch many secrets in one window. Add to filter_* list to exclude FPs
level: medium
