title: Windows Invoke-PowerDump SAM Credential Extraction
id: dd781662-f82f-8e81-7b9d-28cac458f5ab
status: experimental
description: |
  Detects PowerDump module invocation to parse SAM hashes from registry.
author: zendannyy
date: 2026-06-11
references:
  - https://attack.mitre.org/techniques/T1003/002/
  - https://github.com/FortyNorthSecurity/PowerShell-for-Pentesters/blob/master/PowerDump.ps1
  - https://github.com/redcanaryco/atomic-red-team/tree/master/atomics/T1003
tags:
  - attack.credential_access
  - attack.t1003.002
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|contains:
      - 'powershell.exe'
      - 'pwsh'
    CommandLine|contains:
      - 'Invoke-PowerDump'
      - 'PowerDump.ps1'
  condition: selection
fields:
  - ParentImage
  - Image
  - CommandLine
  - User
falsepositives:
  - Authorized offensive security assessments
level: high
