title: Windows Registry Hive Extraction from VSS via certutil
id: 5d30b7e7-99fb-0729-6d39-7e754a089754
status: experimental
description: |
  Detects certutil hex-encoding of SAM/SECURITY/SYSTEM hives from HarddiskVolumeShadowCopy paths.
author: zendannyy
date: 2026-06-11
references:
  - https://attack.mitre.org/techniques/T1003/002/
  - https://lolbas-project.github.io/lolbas/Binaries/Certutil/
  - https://github.com/redcanaryco/atomic-red-team/tree/master/atomics/T1003
tags:
  - attack.credential_access
  - attack.t1003.002
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith: '\certutil.exe'
    CommandLine|contains|all:
      - '-encodehex'
      - 'HarddiskVolumeShadowCopy'
    CommandLine|contains:
      - '\config\sam'
      - '\config\security'
      - '\config\system'
  condition: selection
fields:
  - ParentImage
  - Image
  - CommandLine
  - User
falsepositives:
  - Rare certutil diagnostics against shadow copies
level: high
