title: Windows Registry Hive Copy from VSS via System.IO.File
id: 9dd7d2bd-0803-1afb-1d0b-336ce2b5823f
status: experimental
description: |
  Detects PowerShell copying SAM/SECURITY/SYSTEM from GLOBALROOT shadow copy paths.
author: zendannyy
date: 2026-06-11
references:
  - https://attack.mitre.org/techniques/T1003/002/
  - https://www.microsoft.com/en-us/security/blog/2021/05/27/new-ransomware-threat-to-windows-apis/
  - https://github.com/redcanaryco/atomic-red-team/tree/master/atomics/T1003
tags:
  - attack.credential_access
  - attack.t1003.002
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains|all:
      - '[System.IO.File]::Copy'
      - 'HarddiskVolumeShadowCopy'
    CommandLine|contains:
      - '\config\sam'
      - '\config\security'
      - '\config\system'
  condition: selection
fields:
  - ParentImage
  - Image
  - CommandLine
  - User
falsepositives:
  - Custom backup scripts using shadow copy paths
level: high
