title: Windows SAM Hive Exported via reg export
id: f13787de-2790-7dff-5b36-c715544834d3
status: experimental
description: |
  Detects reg export of HKLM\sam for offline hash extraction.
author: zendannyy
date: 2026-06-11
references:
  - https://attack.mitre.org/techniques/T1003/002/
  - https://lolbas-project.github.io/lolbas/Binaries/Reg/
  - https://github.com/redcanaryco/atomic-red-team/tree/master/atomics/T1003
tags:
  - attack.credential_access
  - attack.t1003.002
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith: '\reg.exe'
    CommandLine|contains|all:
      - 'export'
      - 'HKLM\sam'
  condition: selection
fields:
  - ParentImage
  - Image
  - CommandLine
  - User
falsepositives:
  - Forensic exports with approved procedures
level: high
