title: Windows DCSync via Mimikatz lsadump
id: 56b63929-34ef-d8b0-bdd5-ae36c9feb8be
status: experimental
description: |
  Detects Mimikatz DCSync invocation to replicate AD credentials without touching DC filesystem.
author: zendannyy
date: 2026-06-11
references:
  - https://attack.mitre.org/techniques/T1003/006/
  - https://www.crowdstrike.com/blog/how-adversaries-use-dcsync-to-steal-active-directory-credentials/
  - https://www.sentinelone.com/blog/what-is-dcsync-an-overview/
tags:
  - attack.credential_access
  - attack.t1003.006
logsource:
  product: windows
  category: process_creation
detection:
  selection_dc:
    CommandLine|contains|all:
      - 'lsadump::dcsync'
      - '/domain:'
  selection_sam:
    CommandLine|contains:
    - 'lsadump::sam'
  condition: 1 of selection
fields:
  - Image
  - CommandLine
  - User
  - ParentImage
falsepositives:
  - Authorized AD security assessments using Mimikatz
level: critical
