title: Windows Kerberos Ticket Dumper Script Execution
id: 0f4e24c0-bf26-c113-0dc7-966a9704187d
status: experimental
description: |
  Detects download/execution of PowershellKerberos dumper.ps1 for ticket extraction from LSA.
author: zendannyy
date: 2026-06-11
references:
  - https://attack.mitre.org/techniques/T1003/004/
  - https://github.com/MzHmO/PowershellKerberos
  - https://www.crowdstrike.com/blog/credential-theft-mimikatz-techniques/
  - https://github.com/redcanaryco/atomic-red-team/tree/master/atomics/T1003
tags:
  - attack.credential_access
  - attack.t1003.004
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains:
      - 'dumper.ps1'
      - 'injector.ps1'
      - 'PowershellKerberos'
      - 'MzHmO/PowershellKerberos'
  condition: selection
fields:
  - ParentImage
  - Image
  - CommandLine
  - User
falsepositives:
  - Kerberos troubleshooting by identity teams
level: high
