title: Hunt - Windows Data Encrypted with GPG4Win (T1486)
id: 3f2cdcfe-9641-2dcf-5be1-6d36e5772818
status: experimental
description: |
  Hunting rule loosely modeled after Atomic Red Team T1486 test "Data Encrypted with GPG4Win". No public in-the-wild intel reference available; correlate before alerting.
author: zendannyy
date: 2026-06-27
references:
  - https://attack.mitre.org/techniques/T1486/
  - https://github.com/redcanaryco/atomic-red-team/tree/master/atomics/T1486
tags:
  - attack.impact
  - attack.t1486
  - attack.hunting
logsource:
  product: windows
  category: process_creation
detection:
  selection_binary:
    Image|endswith: '\\gpg.exe'
  selection_cmd:
    CommandLine|contains|all:
      - 'Set-Content -Path'
      - '`"C:\Program'
  selection_phrase:
    CommandLine|contains|expand: '%passphrase%'  
  condition: selection_binary and selection_cmd and selection_phrase:
fields:
  - ParentImage
  - Image
  - CommandLine
  - User
falsepositives:
  - Authorized red team or security assessment activity
  - Tune or disable if overlapping with approved admin tooling
level: informational
