title: Hunt - Windows Modify registry to store logon credentials (T1112)
id: 4107d80f-3496-5723-5055-0017799ab00e
status: experimental
description: |
  Hunting rule loosely based off of Atomic Red Team T1112 test "Modify registry to store logon credentials". No public in-the-wild intel reference available; correlate before alerting.
author: zendannyy
date: 2026-06-27
references:
  - https://attack.mitre.org/techniques/T1112/
  - https://github.com/redcanaryco/atomic-red-team/tree/master/atomics/T1112
tags:
  - attack.execution
  - attack.t1112
  - attack.hunting
logsource:
  product: windows
  category: process_creation
detection:
  selection_binary:
    Image|endswith: '\\reg.exe'
  selection_cmd:
    CommandLine|contains|all:
      - 'HKLM\SYSTEM\CurrentControlSet\Control\SecurityProviders\WDigest'
      - 'UseLogonCredential'
  condition: selection_binary and selection_cmd
fields:
  - ParentImage
  - Image
  - CommandLine
  - User
falsepositives:
  - Authorized red team or security assessment activity
  - Tune or disable if overlapping with approved admin tooling
level: medium
