title: Hunt - Windows Disable Windows Registry Tool (T1112)
id: 01861ded-a563-55c2-253e-8c80fb7f88b0
status: experimental
description: |
  Hunting rule for Atomic Red Team T1112 test "Disable Windows Registry Tool" (Modify Registry). Correlate with additional signals before alerting.
author: zendannyy
date: 2026-06-27
references:
  - https://attack.mitre.org/techniques/T1112/
  - https://github.com/redcanaryco/atomic-red-team/tree/master/atomics/T1112
tags:
  - attack.execution
  - attack.t1112
  - attack.hunting
logsource:
  product: windows
  category: process_creation
detection:
  selection_binary:
    Image|endswith: '\\reg.exe'
  selection_cmd:
    CommandLine|contains:
      - 'HKEY_CURRENT_USER\Software\Microsoft\Windows\CurrentVersion\policies\system'
  condition: selection_binary and selection_cmd
fields:
  - ParentImage
  - Image
  - CommandLine
  - User
falsepositives:
  - Authorized red team or security assessment activity
  - Tune or disable if overlapping with approved admin tooling
level: informational
