title: Hunt - Windows Check internet connection using Test-NetConnection in PowerShell (ICMP (T1016.001)
id: 74143572-dfda-b783-f7d4-21e895af2ecd
status: experimental
description: |
  Hunting rule for T1016.001 "Check internet connection using Test-NetConnection in PowerShell (ICMP-Ping)" (System Network Configuration Discovery: Internet Connection Discovery) using command-line and process indicators derived from executor behavior.
author: zendannyy
date: 2026-06-13
references:
  - https://attack.mitre.org/techniques/T1016/001/
tags:
  - attack.discovery
  - attack.t1016.001
  - attack.hunting
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains|all:
      - 'Test-NetConnection -ComputerName'
      - '-NetConnection'
      - '-ComputerName'
      - 'ping'
  condition: selection
fields:
  - ParentImage
  - Image
  - CommandLine
  - User
falsepositives:
  - Authorized red team or security assessment activity
  - Tune or disable if overlapping with approved admin tooling
level: informational
