title: Hunt - Windows Modify Registry of Local Machine - cmd (T1112)
id: 991a5a96-b935-5ddd-8d74-a83afe8e0640
status: experimental
description: |
  Hunting rule loosely based off of Atomic Red Team T1112 test "Modify Registry of Local Machine - cmd". No public in-the-wild intel reference available; correlate before alerting.
author: zendannyy
date: 2026-06-27
references:
  - https://attack.mitre.org/techniques/T1112/
  - https://github.com/redcanaryco/atomic-red-team/tree/master/atomics/T1112
tags:
  - attack.execution
  - attack.t1112
  - attack.hunting
logsource:
  product: windows
  category: process_creation
detection:
  selection_binary:
    Image|endswith: '\\reg.exe'
  selection_cmd:
    CommandLine|contains|all:
      - 'HKEY_LOCAL_MACHINE\Software\Microsoft\Windows\CurrentVersion\Run'
      - 'SecurityHealth'
  condition: selection_binary and selection_cmd
fields:
  - ParentImage
  - Image
  - CommandLine
  - User
falsepositives:
  - Authorized red team or security assessment activity
level: medium
