title: Hunt - Windows Remote Code Execution with PS Credentials Using Invoke-Command (T1021.006)
id: 7e2433bb-f3f8-e98e-930a-883dc629ad48
status: experimental
description: |
  Hunting rule for T1021.006 test "Remote Code Execution with PS Credentials Using Invoke-Command" (Remote Services: Windows Remote Management) using command-line and process indicators derived from executor behavior.
author: zendannyy
date: 2026-06-15
references:
  - https://attack.mitre.org/techniques/T1021/006/
  - https://github.com/redcanaryco/atomic-red-team/tree/master/atomics/T1021
tags:
  - attack.lateral_movement
  - attack.t1021.006
  - attack.hunting
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains|all:
      - 'Invoke-Command -ComputerName'
      - 'Enable-PSRemoting -Force'
      - '$env:COMPUTERNAME'
  condition: selection
fields:
  - ParentImage
  - Image
  - CommandLine
  - User
falsepositives:
  - Authorized red team or security assessment activity
  - Tune or disable if overlapping with approved admin tooling
level: informational
