title: Suspicious Parent Spawning Shell
id: 82886d31-bae2-43e4-8d39-fe660de29da7
description: | 
  Classic parent child process tree use case.
status: experimental
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection_parent:
    ParentImage|endswith:
        - '\outlook.exe'
        - '\winword.exe'

  selection_child:
    Image|contains:
        - 'cmd.exe'
        - 'cscript.exe'
        - 'powershell.exe'

  condition: 1 of selection_*
fields:
  - ParentImage
  - Image
  - ParentCommandLine
  - CommandLine
  - User
level: high
