title: macOS Potentially Susp Child Process Of VsCode
id: 176a8140-4271-40c2-8c89-fc1a87f1d53d
status: test
description: Detects uncommon or suspicious child processes spawning from a VsCode process. This could indicate an attempt of persistence via VsCode tasks or terminal profiles.
author:zendannyy
tags:
    - attack.execution
    - attack.stealth
    - attack.t1218
    - attack.t1202
logsource:
    category: process_creation
    product: macos
detection:
    selection_parent:
        ParentImage|endswith: '\Code'
    selection_children_images:
        Image|contains:
            - 'bash'
            - 'sh'
            - 'python'
            - 'perl'
    selection_children_paths:
        Image|contains:
            - '/tmp'
    condition: selection_parent and 2 of selection_children_*
falsepositives:
    - In development environment where VsCode is used heavily. False positives may occur when developers use to compile or execute different types of code. Remove or add processes accordingly
level: medium