title: Linux Lateral Tool Transfer Hunt
id: 9312cc72-8a60-4e69-97ca-020b5ea0c8f8
status: experimental
description: Hunting rule for lateral tool transfer activities using common utilities. i.e. copying files from one compromised system to another.
references:
    - https://attack.mitre.org/techniques/T1570/
    - https://community.f5.com/kb/technicalarticles/overview-of-mitre-attck-tactic-ta0008---lateral-movement/344580
author: zendannyy
date: 2026-02-24
tags:
    - attack.lateral_movement
    - attack.t1570
logsource:
    category: process_creation
detection:
    selection_transfer_tools:
        Image|endswith:
            - '/scp'
            - '/rsync'
            - '/wget'
            - '/curl'
    selection_remote_targets:
        CommandLine|re: '\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}'
    selection_executable_transfer:
        CommandLine|contains:
            - '.sh'
            - '.py'
            - '.pl'
            - '.elf'
    condition: selection_transfer_tools and selection_remote_targets and selection_executable_transfer
falsepositives:
    - Legitimate file synchronization
    - Backup operations
level: medium