title: Linux Setcap Assuming All Capabilities
id: 1928dd52-1453-43ae-b8a8-d210c704cf4a
status: test
description: |
    Detects the use of the 'setcap' utility with parameters that assign all Linux capabilities to a binary file.
    This capability can be abused to create a backdoored binary, enabling unauthorized access, privilege escalation, and bypassing security controls.
references:
    - https://man7.org/linux/man-pages/man8/setcap.8.html
    - https://man7.org/linux/man-pages/man7/cap_text_formats.7.html
    - https://juggernaut-sec.com/capabilities/
author: zendanny
date: 2026-03-11
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.persistence
    - attack.t1554
logsource:
    product: linux
    category: process_creation
detection:
    selection_all:
        Image|endswith: '/setcap'
        CommandLine|contains:
          # cases where `all' capabilities are assumed
          - ' ='
          - ' all='
    selection_explicit:
      Image|endswith: '/setcap'
      CommandLine|contains:
        # cases where capabilities are explicitly set
            - ' =e'
            - ' =i'
            - ' =p'
    condition: selection_all or selection_explicit
falsepositives:
    - Development/Debugging 
level: medium
