title: Linux Backdoor Account Creation
id: 87fcfec8-55c1-4dae-8a82-a4e21d7d5c9b
status: experimental
description: Detects creation of backdoor accounts with high privileges such as root.
references:
    - https://attack.mitre.org/techniques/T1136/001/
author: zendannyy
date: 2026-02-26
tags:
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1136.001
logsource:
    category: process_creation
detection:
    selection_useradd:
        Image|endswith: '/useradd'
    selection_high_privileges:
        CommandLine|contains:
            - '-u 0'
            - '-g 0'
            - '--uid=0'
            - '--gid=0'
    selection_no_home:
        CommandLine|contains:
            - '--no-create-home'
            - '-M'
    condition: selection_useradd and (selection_high_privileges or selection_no_home)
falsepositives:
    - Container user setup
    - System service account creation
level: high
