title: Linux Kernel Module Insertion
id: b8137f5f-e624-4f8b-bb45-cdd3b117f57f
status: experimental
description: Detects commands that load kernel modules, which may indicate rootkit activity.
author: zen
date: 2026-04-20
logsource:
  product: linux
  category: process_creation
detection:
  selection_tool:
    Image|endswith:
      - '/insmod'
      - '/modprobe'
      - '/kmod'
  selection_module_hint:
    CommandLine|contains:
      - '.ko'
      - ' --force'
  condition: selection_tool and selection_module_hint
fields:
  - CommandLine
  - Image
  - User
  - ParentImage
falsepositives:
  - Legitimate driver installation
level: high
tags:
  - attack.persistence
  - attack.t1547.006
